---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Energy
source: html/4b87b7c6-a115-ac60-6ef7-c807a317e4bd.htm
---
# Autodesk.Revit.DB.SpecTypeId.Energy Property

Energy, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Energy { get; }
```